#include <stdio.h>
#include <conio.h>
#include <stdlib.h>

struct sobytiya
    {
        int day;
        int month;
        int year;
        char event[60];
    };

struct sobytiya s[14]=
    {
        16, 5, 1703, "основание Санкт-Петербурга",
        27, 6, 1709, "Полтавская битва",
        2, 11, 1721, "провозглашение Петра I императором, России – империей.",
        18, 5, 1724, "Коронация Екатерины I",
        25, 1, 1725, "Дворцовый переворот 1725 года",
        6, 5, 1727, "Коронация Петра II",
        7, 9, 1727, "Дворцовый переворот 1727 года",
        9, 5, 1730, "Коронация Анны Ионновны",
        9, 11, 1740, "Дворцовый переворот 1740 года",
        6, 12, 1741, "Дворцовый переворот 1741 года",
        6, 5, 1742, "Коронация Елизаветы Петровны",
        28, 6, 1762, "Дворцовый переворот 1762 года",
        3, 10, 1762, "Коронация Екатерины II",
        16, 4, 1797, "Коронация Павла I"
    };


int main()
{
    system("chcp 1251");
    system("cls");
    int i, n=14;
    for (i=0; i<n; i++)
        printf("\n%2d.%2d.%4d - %s", s[i].day, s[i].month, s[i].year, s[i].event);
    getch();
    return 0;
}

